Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum Enumeration
 Defines the analysis decomposed load directions.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AnalysisDecomposedLoadDirectionEnum
Public Enumeration AnalysisDecomposedLoadDirectionEnum
Members
Member name | Value | Description
X | 1 |  The analysis decomposed load direction is in the direction of the X-axis.
Y | 2 |  The analysis decomposed load direction is in the direction of the Y-axis.
Z | 3 |  The analysis decomposed load direction is in the direction of the Z-axis.
RX | 4 |  The analysis decomposed load direction is in the rotation of the X-axis.
RY | 5 |  The analysis decomposed load direction is in the rotation of the Y-axis.
RZ | 6 |  The analysis decomposed load direction is in the rotation of the Z-axis.
See Also
Reference
Tekla.Structures.Analysis Namespace